dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32-autofan
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Original ESP32 has no assist-debug module
# (SOC_ASSIST_DEBUG_SUPPORTED is unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD
# isn't available here -- pair with the end-of-stack hardware watchpoint for
# deterministic (not sampled-at-context-switch) detection. See
# components/bb_health/Kconfig.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_BB_DIAG_PANIC_COREDUMP=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
CONFIG_BB_FAN_AUTOFAN=y

# B1-1275: disable WPA2/WPA3-Enterprise WiFi -- the enterprise (802.1X/EAP)
# connection path is unused (no esp_wifi_sta_enterprise_*/esp_eap_client_*
# call sites); this shrinks compiled-in attack surface, not flash --
# linker --gc-sections was already stripping most of the dead code, so the
# measured delta is negligible either way (esp32 +168B, esp32c3 -722B).
# TLS, the mbedTLS cert bundle, and WPA3-Personal/SAE
# (CONFIG_ESP_WIFI_ENABLE_WPA3_SAE) are untouched.
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
